{-# OPTIONS --prop --rewriting --with-K --confluence-check --no-postfix-projections --hidden-argument-puns #-}

module StricterSyntax.D where

open import Lib
open import Dictatorship.Syntax
open import Dictatorship.DepModel
open I

open import Dictatorship.QIIRT.Sorts
open Con∙
open Sub∙
open Ty∙
open Tm∙

open import Dictatorship.QIIRT.CwF
open import Dictatorship.QIIRT.Sigma
open import Dictatorship.QIIRT.Pi
open import Dictatorship.QIIRT.Empty
open import Dictatorship.QIIRT.Bool

D : DepModel {lzero} {lzero} {lzero}
D = record
     { sorts∙ = record { Dictatorship.QIIRT.Sorts }
     ; cwf∙ = record
               { Dictatorship.QIIRT.CwF
               ; ass∙ = λ {Γ}{Δ}{Γ∙}{Δ∙}{γ}{γ∙}{Θ}{Θ∙}{δ}{δ∙}{Ξ}{Ξ∙}{θ}{θ∙} → ass∙ {Γ}{Δ}{Γ∙}{Δ∙}{γ}{γ∙}{Θ}{Θ∙}{δ}{δ∙}{Ξ}{Ξ∙}{θ}{θ∙}
               ; [∘]T∙ = λ {Γ}{Γ∙}{A}{A∙}{Δ}{Δ∙}{γ}{γ∙}{Θ}{Θ∙}{δ}{δ∙} → [∘]T∙ {Γ}{Γ∙}{A}{A∙}{Δ}{Δ∙}{γ}{γ∙}{Θ}{Θ∙}{δ}{δ∙}
               ; [∘]t∙ = λ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙}{Θ}{δ}{Θ∙}{δ∙} → [∘]t∙ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙}{Θ}{Θ∙}{δ}{δ∙}
               ; p∙ = λ {Γ}{Γ∙}{A}{A∙} → p∙ {Γ}{Γ∙}{A}{A∙} 
               ; q∙ = λ {Γ}{Γ∙}{A}{A∙} → q∙ {Γ}{Γ∙}{A}{A∙}
               ; _⁺∙ = λ {Δ}{Δ∙}{Γ}{Γ∙}{γ}{A}{A∙} → _⁺∙ {Δ}{Δ∙}{Γ}{Γ∙}{γ}{A}{A∙}
               ; ∘⁺∙ = λ {Δ}{Δ∙}{Γ}{γ}{Γ∙}{γ∙}{Θ}{δ}{Θ∙}{δ∙}{A}{A∙} → ∘⁺∙ {Δ}{Δ∙}{Γ}{γ}{Γ∙}{γ∙}{Θ}{δ}{Θ∙}{δ∙}{A}{A∙}
               ; id⁺∙ = λ {Γ}{A}{Γ∙}{A∙} → id⁺∙ {Γ}{A}{Γ∙}{A∙}
               ; ⟨⟩∘∙ = λ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙} → ⟨⟩∘∙ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙}
               ; p∘⁺∙ = λ {Δ}{Γ}{Γ∙}{γ}{Δ∙}{γ∙}{A}{A∙} → p∘⁺∙ {Δ}{Γ}{Γ∙}{γ}{Δ∙}{γ∙}{A}{A∙}
               ; p∘⟨⟩∙ = λ {Γ}{A}{Γ∙}{A∙}{a}{a∙} → p∘⟨⟩∙ {Γ}{A}{Γ∙}{A∙}{a}{a∙}
               ; q[⁺]∙ = λ {Γ}{Γ∙}{Δ}{γ}{Δ∙}{γ∙}{A}{A∙} → q[⁺]∙ {Γ}{Γ∙}{Δ}{γ}{Δ∙}{γ∙}{A}{A∙}
               ; q[⟨⟩]∙ = λ {Γ}{A}{Γ∙}{A∙}{a}{a∙} → q[⟨⟩]∙ {Γ}{A}{Γ∙}{A∙}{a}{a∙}
               ; ▹η∙ = λ {Γ}{Γ∙}{A}{A∙} → ▹η∙ {Γ}{Γ∙}{A}{A∙}
               }
     ; sigma∙ = record
                 { Dictatorship.QIIRT.Sigma
                 ; ⊤[]∙ = λ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙} → ⊤[]∙ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙}
                 ; Σ[]∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{Δ}{Δ∙}{γ}{γ∙} → Σ[]∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{Δ}{Δ∙}{γ}{γ∙}
                 ; _,∙_ = λ {Γ}{Γ∙}{A}{A∙}{a}{B}{B∙}{b} → _,∙_ {Γ}{Γ∙}{A}{A∙}{a}{B}{B∙}{b}
                 ; ,[]∙ = λ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{B}{b}{B∙}{b∙}{Δ}{γ}{Δ∙}{γ∙} → ,[]∙ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{B}{b}{B∙}{b∙}{Δ}{γ}{Δ∙}{γ∙}
                 ; fst∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{a} → fst∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{a}
                 ; snd∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{a} → snd∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{a}
                 ; Σβ₁∙ = λ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{B}{b}{B∙}{b∙} → Σβ₁∙ {Γ}{A}{Γ∙}{A∙}{a}{a∙}{B}{b}{B∙}{b∙}
                 ; Σβ₂∙ = λ {Γ} {Γ∙} {A} {a} {B} {b} {A∙} {a∙} {B∙} {b∙} → Σβ₂∙ {Γ} {Γ∙} {A} {a} {B} {b} {A∙} {a∙} {B∙} {b∙}
                 ; Ση∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{a}{a∙} → Ση∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{a}{a∙}
                 }
     ; pi∙ = record
              { Dictatorship.QIIRT.Pi
              ; Π[]∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{Δ}{Δ∙}{γ}{γ∙} → Π[]∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{Δ}{Δ∙}{γ}{γ∙}
              ; lam∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{b} → lam∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{b}
              ; app∙ = λ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{f}{a} → app∙ {Γ}{Γ∙}{A}{A∙}{B}{B∙}{f}{a}
              ; Πβ∙ = λ {Γ}{A}{B}{Γ∙}{A∙}{B∙}{b}{b∙}{a}{a∙} → Πβ∙ {Γ}{A}{B}{Γ∙}{A∙}{B∙}{b}{b∙}{a}{a∙}
              ; Πη∙ = λ {Γ} {Γ∙} {A} {B} {f} {A∙} {B∙} {f∙} → Πη∙ {Γ} {Γ∙} {A} {B} {f} {A∙} {B∙} {f∙}
              ; lam[]∙ = λ {Γ}{A}{B}{Γ∙}{A∙}{B∙}{b}{b∙}{Δ}{Δ∙}{γ}{γ∙} → lam[]∙ {Γ}{A}{B}{Γ∙}{A∙}{B∙}{b}{b∙}{Δ}{Δ∙}{γ}{γ∙}
              ; app[]∙ = λ {Γ}{Γ∙}{A}{B}{f}{A∙}{B∙}{f∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙} → app[]∙ {Γ}{Γ∙}{A}{B}{f}{A∙}{B∙}{f∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙}
              }
     ; empty∙ = record
                 { Dictatorship.QIIRT.Empty
                 ; ⊥[]∙ = λ {Δ}{Δ∙}{Γ}{Γ∙}{γ}{γ∙} → ⊥[]∙ {Δ}{Δ∙}{Γ}{Γ∙}{γ}{γ∙}
                 ; exfalso[]∙ = λ {Γ}{Γ∙}{A}{A∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙} → exfalso[]∙ {Γ}{Γ∙}{A}{A∙}{a}{a∙}{Δ}{Δ∙}{γ}{γ∙}
                 }
     ; bool∙ = record
                { Dictatorship.QIIRT.Bool
                ; Bool[]∙ = λ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙} → Bool[]∙ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙}
                ; true[]∙ = λ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙} → true[]∙ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙}
                ; false[]∙ = λ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙} → false[]∙ {Δ}{Γ}{Δ∙}{Γ∙}{γ}{γ∙}
                ; elim[]∙ = λ {Γ} {Δ} {A} {a} {b} {c} {γ} {Γ∙} {Δ∙} {A∙} {a∙} {b∙} {c∙} {γ∙} → elim[]∙ {Γ} {Δ} {A} {a} {b} {c} {γ} {Γ∙} {Δ∙} {A∙} {a∙} {b∙} {c∙} {γ∙}
                ; Boolβ₁∙ = λ {Γ} {A} {Γ∙} {A∙} {a} {a∙} {b} {b∙} → Boolβ₁∙ {Γ} {A} {Γ∙} {A∙} {a} {a∙} {b} {b∙}
                ; Boolβ₂∙ = λ {Γ} {A} {Γ∙} {A∙} {a} {a∙} {b} {b∙} → Boolβ₂∙ {Γ} {A} {Γ∙} {A∙} {a} {a∙} {b} {b∙}
                }
     }
